#include "exti.h"
  /**************************************************************************
作者：平衡小车之家
我的淘宝小店：http://shop114407458.taobao.com/
**************************************************************************/
/**************************************************************************
函数功能：外部中断初始化
入口参数：无
返回  值：无 
**************************************************************************/
void EXTI_Init(void)
{
	RCC->APB2ENR|=1<<3;    //使能PORTB时钟	   	 
	GPIOB->CRL&=0XFFFF0FFF; 
	GPIOB->CRL|=0X00008000;//PB3上拉输入
  GPIOB->ODR|=1<<3; //PB3 上拉	
	Ex_NVIC_Config(GPIO_B,3,FTIR);		//下降沿触发
	MY_NVIC_Init(2,1,EXTI3_IRQn,2);  	//抢占2，子优先级1，组2
}






